In [3]:
import pandas as pd
data_url = 'https://andybek.com/pandas-soccer'
players = pd.read_csv(data_url)
players.head(n=2)

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
0,Alexis Sanchez,Arsenal,28,LW,1,65.0,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0
1,Mesut Ozil,Arsenal,28,AM,1,50.0,4395,9.5,5.60%,167,2,Germany,0,4,1,1,0

In [4]:
# ch3elsea players and 23 years old or younger
chelsea_23_under = (players.club == 'Chelsea') & (players.age.le(23))
players.loc[chelsea_23_under]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
110,Michy Batshuayi,Chelsea,23,CF,1,25.0,1162,8.5,1.60%,48,2,Belgium,0,2,5,1,1
111,Kurt Zouma,Chelsea,22,CB,3,15.0,723,5.5,0.80%,15,2,France,0,2,5,1,0
112,Kenedy,Chelsea,21,LB,3,7.0,566,5.0,0.10%,3,3,Brazil,0,1,5,1,0
115,Tiemoue Bakayoko,Chelsea,22,DM,2,16.0,1011,5.0,1.60%,0,2,France,1,2,5,1,0

In [5]:
players.loc[chelsea_23_under, ['position', 'market_value']]

    position  market_value
110       CF          25.0
111       CB          15.0
112       LB           7.0
115       DM          16.0

In [6]:
# ... select all column that begin with 'p'103.ipynb
mask = players.columns.str.startswith('p')
players.loc[:,mask]

    position  position_cat  page_views
0         LW             1        4329
1         AM             1        4395
2         GK             4        1529
3         RW             1        2393
4         CB             3         912
..       ...           ...         ...
460       CM             2         288
461       LB             3         199
462       RB             3         198
463       CF             1         412
464       CF             1         214

[465 rows x 3 columns]

In [7]:
p_cols = players.columns.str.startswith('p')
players.loc[chelsea_23_under, p_cols]

    position  position_cat  page_views
110       CF             1        1162
111       CB             3         723
112       LB             3         566
115       DM             2        1011

In [8]:
len(chelsea_23_under) == len(players)

True

In [9]:
len(p_cols) == len(players.columns)

True

In [10]:
p_cols.shape

(17,)

In [11]:
players.shape

(465, 17)

In [12]:
players[chelsea_23_under]['position']

110    CF
111    CB
112    LB
115    DM
Name: position, dtype: object

In [13]:
players.loc[chelsea_23_under,'position']

110    CF
111    CB
112    LB
115    DM
Name: position, dtype: object